Documents/ИнвойсЗакупки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ИнвойсЗакупки</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПлатежныйКалендарьЗакупки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИнвойсаПоставщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИнвойсаПоставщика</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНаСкладеОтправителя</Name>
					<Comment>Дата на складе отправителя</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИнспекции</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КтоИнспектировал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Авианакладная</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопРасходы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комиссия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛокальныйСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыИнвойса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОплатыВВалютеИнвойса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недоплата</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаТТН</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Перевозчики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МетодОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МетдыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Оплаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>13</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Курс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>11</v8:Digits>
									<v8:FractionDigits>7</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВВалютеИнвойса</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Треки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Трек</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>22</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ХранилищеФайлов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ХранилищеФайлов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ХранилищеДвоичныхДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерФайла</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПутьФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОбъектУИД</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектСсылка</Name>
					<Comment>Хранение ссылки на объект Не позволит штатными средствами удалить объект без очистки всех прикреплений</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВладелецПрисоединенныхФайлов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МестоХраненияФайлов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МестоХраненияПрикрепленныхФайлов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РасширениеИмениФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НазначениеФайла</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НазначениеФайлов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/НазначениеФайлов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>НазначениеФайлов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Оплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыОплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СтатусыОплаты</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>NotPaid</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PartlyPaid</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PaidNotReceivded</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Paid</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>WithoutPayment</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ИнвойсЗакупки/Forms/ФормаСписка/Ext/Form/Module.bsl
// © Primus1C  26.06.2023  НАЧАЛО ►

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Если НЕ РольДоступна("ИнвойсЗакупкиМинимальный") Тогда
	//	Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса,
	//								"3 КАК Инвойс",
	//								"ВЫБОР
	//								|КОГДА СостоянияИнвойсов.Инвойс = ЗНАЧЕНИЕ(Документ._Инвойс.ПустаяСсылка)
	//								|	ТОГДА 3
	//								|КОГДА СостоянияИнвойсов.Инвойс.Проведен
	//								|	ТОГДА 0
	//								|КОГДА СостоянияИнвойсов.Инвойс.ПометкаУдаления
	//								|	ТОГДА 2
	//								|ИНАЧЕ 1
	//								|КОНЕЦ КАК Инвойс");
	//КонецЕсли;
	
	гоСтандартныйОтборПоПолю("Контрагенты", Список, "Контрагент");
	
	глПокраситьВалюты(ЭтаФорма, "Валюта");
	
	лРаскраскаСтатусов =  ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("РаскрашиватьСтатусыВФормеСписка");
	глПокраситьСтатусы(ЭтаФорма, "Список", лРаскраскаСтатусов, лРаскраскаСтатусов, лРаскраскаСтатусов);  
    //глПокраситьПомеченныеНаУдаление(ЭтаФорма);

	Элементы.КоличествоСообщений.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьСообщения");
	
	//ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаСоздатьНаОсновании.Видимость = Ложь;
	Попытка
	ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаСоздатьНаОсновании.ПодчиненныеЭлементы.ФормаДокумент_ИнвойсСоздатьНаОсновании.Видимость = Ложь;
	Исключение
	КонецПопытки;

	ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаОбновить.ПоложениеВКоманднойПанели = ПоложениеКнопкиВКоманднойПанели.ВКоманднойПанелиИВДополнительномПодменю;

КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если Поле.Имя = "Вложения" Тогда
		СтандартнаяОбработка = Ложь;
		//ОткрытьФорму("РегистрСведений.ХранилищеФайлов.Форма.УпрФормаСписка", 
		//			Новый Структура("ОбъектУИД,Владелец", ВыбраннаяСтрока.УникальныйИдентификатор(), ВыбраннаяСтрока), 
		//			ЭтаФорма);    
		ПараметрыФормы = Новый Структура("ВладелецСсылка, НазначениеФайла, ИмяАктивнойГиперссылки, ДобавлениеФайла", 
									ВыбраннаяСтрока, 
									ПредопределенноеЗначение("Перечисление.НазначениеФайлов.Прочее"),
									"Файл_П0",
									Неопределено);
		ОткрытьФорму("Обработка.Предпросмотр.Форма.ФормаПредпросмотра", ПараметрыФормы, ЭтаФорма,,,, );

	ИначеЕсли Поле.Имя = "Инвойс" Тогда		
	    СтандартнаяОбработка = Ложь; 
		Спис = ПодчиненныеИнвойсы(ВыбраннаяСтрока);
		Если Спис.Количество() = 1 Тогда
        	ОткрытьЗначение(Спис.Получить(0).Значение);   
		Иначе
			Инв = ВыбратьИзМеню(Спис, Элемент);   
			Если Инв <> Неопределено Тогда
				ОткрытьЗначение(Инв);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПодчиненныеИнвойсы(ИнвойсЗакупкиСсылка)

	Запр = Новый Запрос; 
	Запр.УстановитьПараметр("ДокументОснование", ИнвойсЗакупкиСсылка);
	Запр.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	             |	_Инвойс.Ссылка,
	             |	_Инвойс.ПометкаУдаления,
	             |	_Инвойс.Проведен,
	             |	_Инвойс.ВКД_НомерИнвойсаПоставщика,
	             |	_Инвойс.ВКД_ДатаИнвойсаПоставщика,
	             |	_Инвойс.ВидОперации
	             |ИЗ
	             |	Документ._Инвойс КАК _Инвойс
	             |ГДЕ
	             |	_Инвойс.ДокументОснование = &ДокументОснование
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	_Инвойс.Дата";
    Выборка = Запр.Выполнить().Выбрать();  
	Спис = Новый СписокЗначений;
	Пока Выборка.Следующий() Цикл
    	Спис.Добавить(	Выборка.Ссылка, 
						СтрШаблон("%1 (%2)", Выборка.ВКД_НомерИнвойсаПоставщика, Выборка.ВидОперации), , 
						?(Выборка.Проведен, БиблиотекаКартинок.ДокументПроведен, ?(Выборка.ПометкаУдаления, БиблиотекаКартинок.ДокументУдален, БиблиотекаКартинок.ДокументНеПроведен))	);
	КонецЦикла;
	Возврат Спис;
	
КонецФункции 

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)

	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		Если Элемент.ТекущиеДанные.Свойство("СтатусОплаты") Тогда
			Если Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.Найти("ФормаДокументИнвойсЗакупкиОплатить") <> Неопределено Тогда
				Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаДокументИнвойсЗакупкиОплатить.Доступность = Элемент.ТекущиеДанные.СтатусОплаты <> ПредопределенноеЗначение("Перечисление.СтатусыОплаты.Paid");
			КонецЕсли;
			Если Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.Найти("ФормаДокументИнвойсЗакупкиОтменитьОплату") <> Неопределено Тогда
				Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаДокументИнвойсЗакупкиОтменитьОплату.Доступность = Элемент.ТекущиеДанные.СтатусОплаты <> ПредопределенноеЗначение("Перечисление.СтатусыОплаты.NotPaid");
			КонецЕсли;  
		КонецЕсли;	             
		Если Элемент.ТекущийЭлемент <> Неопределено Тогда
			//Если Элемент.ТекущийЭлемент.Имя = "Вложения" Тогда
				ДобавитьКомандыСохраненияВложений(Элемент.ТекущаяСтрока);
			//КонецЕсли; 
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ДобавитьКомандыСохраненияВложений(ИнвойсСылка)
	
	возврат;
	масФайлов = РегистрыСведений.ХранилищеФайлов.ПолучитьМассивФайлов(ИнвойсСылка, Перечисления.НазначениеФайлов.Прочее);
	
	Для Инд = 0 По масФайлов.ВГраница() Цикл
	
		ИмяКоманды = "СохранитьВложение_" + Формат(Инд,"ЧЦ=2; ЧВН=");
		Команда = Команды.Добавить(ИмяКоманды);
		Команда.Заголовок = "Сохранить: " + 1;
		Команда.Действие  = "СохранениеВложенияИзКонтекстногоМеню";

		КнопкаКоманды = Элементы.Добавить("КнопкаКоманды" + ИмяКоманды, Тип("КнопкаФормы"), Элементы.Список.КонтекстноеМеню);
		КнопкаКоманды.ИмяКоманды = ИмяКоманды;

	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененСтатусОплаты" Тогда
		СписокПриАктивизацииСтроки(Элементы.Список);	
	КонецЕсли;                                      
	
КонецПроцедуры                                      

// © Primus1C  ОКОНЧАНИЕ ◄
